#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/public-ips-dev/runs/run-vuT4qf4rxvDJfent

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_eip.fnx_peplink_ip["18.136.88.248"]: Refreshing state... [id=eipalloc-0b2e9058c419b7511]
aws_eip.fnx_peplink_ip["13.213.106.15"]: Refreshing state... [id=eipalloc-0ba78b5813b9438c4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.fnx_peplink_ip["13.213.106.15"] must be replaced
-/+ resource "aws_eip" "fnx_peplink_ip" {
      + address              = "13.213.106.15" # forces replacement
      ~ allocation_id        = "eipalloc-0ba78b5813b9438c4" -> (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      ~ domain               = "vpc" -> (known after apply)
      ~ id                   = "eipalloc-0ba78b5813b9438c4" -> (known after apply)
      + instance             = (known after apply)
      ~ network_border_group = "ap-southeast-1" -> (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      ~ public_dns           = "ec2-13-213-106-15.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip            = "13.213.106.15" -> (known after apply)
      ~ public_ipv4_pool     = "amazon" -> (known after apply)
        tags                 = {
            "Name" = "peplink-public-ip-2"
        }
      ~ tags_all             = {
          + "Type" = "Managed by Terraform"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # aws_eip.fnx_peplink_ip["18.136.88.248"] must be replaced
-/+ resource "aws_eip" "fnx_peplink_ip" {
      + address              = "18.136.88.248" # forces replacement
      ~ allocation_id        = "eipalloc-0b2e9058c419b7511" -> (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      ~ domain               = "vpc" -> (known after apply)
      ~ id                   = "eipalloc-0b2e9058c419b7511" -> (known after apply)
      + instance             = (known after apply)
      ~ network_border_group = "ap-southeast-1" -> (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      ~ public_dns           = "ec2-18-136-88-248.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip            = "18.136.88.248" -> (known after apply)
      ~ public_ipv4_pool     = "amazon" -> (known after apply)
        tags                 = {
            "Name" = "peplink-public-ip-1"
        }
      ~ tags_all             = {
          + "Type" = "Managed by Terraform"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ fnx_peplink_public_ips = [
      ~ {
          ~ eip_id     = "eipalloc-0b2e9058c419b7511" -> (known after apply)
          ~ ip_address = null -> "13.213.106.15"
        },
      + {
          + eip_id     = (known after apply)
          + ip_address = "18.136.88.248"
        },
    ]

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @JoseFMP, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Action for Pull Requests`*